[
    {
        "company": "Carissma - Project BALSAM",
        "company_location": "Ingolstadt",
        "role": "Student research assistant",
        "time_duration": "Oct 2023 - Present",
        "details": [
        	{
                "description": "Proficient in utilizing CATIA and Solidworks to develop innovative external casing designs for battery systems.",
            
            },
        	{
                
                "description": "Conduct thorough assessments of gas emissions from the battery to ensure compliance with regulatory standards.",
                
            },
            {
                
                "description": "Devise novel approaches for the convenient extraction of the battery pack, enhancing serviceability and maintenance
                efficiency",
                
            },
        
        ]
    },
    {
        "company": "Schanzer Racing Electric",
        "company_location": "Ingolstadt",
        "role": "Team Leader - Powertrain Department",
        "time_duration": "Mar 2023 - Feb 2024",
        "details": [
            {
                
                "description": " Supervise the gearbox design process for SRE23 and SRE24 cars utilizing CATIA V5, ensuring accuracy and
                efficiency",
                
            },
            {
                    
                 "description": "Skillfully assemble gearboxes and integrated cooling systems, enhancing the overall functionality of the vehicles
                 ",
                    
            },
            {
                
                "description": "Collaborate with diverse teams involved in designing and calculating components for autonomous vehicles and
                chassis development",
               	
            },
            {
                
                "description": "Lead team meetings to promote effective communication and coordination, while also coordinating with other
                departments to ensure smooth integration of project elements",
               	
            }
        ]
    },
    {
        "company": "Audi AG",
        "company_location": "Ingolstadt",
        "role": "Assembly and Quality Inspector",
        "time_duration": "Aug 2023 - Sep 2023",
        "details": [
            {
        
                "description": " Assembling of door rubber seals and windows.",
               
            },
            {
                
                "description": "Conduct quality checks on doors to ensure high standards are maintained
                .",
                
            }
        ]
    },
    {
        "company": "Oracle",
        "company_location": "Bangalore, India",
        "role": "Software Engineering Intern",
        "team": "Apps for Enterprises",
        "time_duration": "May 2013 - July 2013",
        "details": [
            {
                "title": "Containerization of iOS Apps",
                "description": "Worked on sand-boxing of enterprise applications (containerization), enabling their installation on employee's iOS devices, without worrying about security concerns. Implemented wrapping of library function calls using swizzling, objective-c backend, linker flags and dynamic library injection.",
                "languages": "Objective-C C"
            },
            {
                "title": "Sandboxed Browser App",
                "description": "Built a demo browser application for iOS. Containerized the app using the custom script, for it to work only for whitelisted urls.",
                "languages": "Objective-C"
            }
        ]
    }
]
